tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

tap "derailed/k9s"
tap "hashicorp/tap"
tap "railwaycat/emacsmacport"

cask_args appdir: "/Applications"

## Brews
# macOS App Store
brew "mas"

# Shell essentials
brew "zsh"
brew "antidote"
brew "tmux"

# Replacements for system programs
brew "bash"
brew "coreutils"
brew "gawk"
brew "gnu-sed"
brew "grep"
brew "vim"

# Version control
brew "git"
brew "mercurial"

# Git helpers
brew "gh"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"

# Editors
brew "neovim"

# Languages and package managers
brew "python"
brew "hashicorp/tap/terraform"

brew "mise"        # Language-agnostic
brew "opam"        # Manages OCaml
brew "rustup-init" # Manages Rust
brew "uv"          # Manages Python

brew "ruff"          # Python linter/formatter
brew "rust-analyzer" # Rust LSP
brew "tflint"        # Terraform linter

# Databases
brew "postgresql@16"

# Shell niceties
brew "curlie"
brew "fzf"
brew "htop"
brew "jq"
brew "ncdu"
brew "shellcheck"
brew "wget"

# Rust-based shell tools
brew "bat"       # cat
brew "difftastic"
brew "eza"       # ls
brew "hyperfine" # bench
brew "fd"        # find
brew "ripgrep"   # grep
brew "xsv"

# Containers
brew "dive"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "skopeo"

# Kubernetes
brew "helm"
brew "k3d"
brew "derailed/k9s/k9s"

# External services
brew "magic-wormhole"

# Video
brew "ffmpeg"
brew "yt-dlp"

# AI
brew "huggingface-cli"

# Build tools/dependencies
brew "ccache"
brew "cmake"
brew "libuv"
brew "ninja"
brew "pkg-config"
brew "sccache"

# Dependencies for npm `canvas`:
# https://www.npmjs.com/package/canvas
brew "cairo"
brew "pango"
brew "libpng"
brew "jpeg"
brew "giflib"
brew "librsvg"
brew "pixman"

# Miscellaneous tools
brew "gnupg"
brew "graphviz"
brew "pandoc"
brew "pngcrush"
brew "pngquant"
brew "protobuf"

# Cloud CLIs
brew "awscli"

## Casks
# Fonts
cask "font-dejavu"
cask "font-fira-sans"
cask "font-source-code-pro"

# Programming tools
cask "emacs-mac"
cask "iterm2"
cask "orbstack"
cask "utm"
cask "visual-studio-code"

# Utilities
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "karabiner-elements"
cask "mitmproxy"
cask "monitorcontrol"
cask "rectangle"

# AI
cask "ollama"

# Browsers
cask "firefox-beta"
cask "google-chrome"

# Storage
cask "dropbox"

# Audio
cask "audio-hijack"
cask "focusrite-control"
cask "spotify"

# Objective-See utilities
cask "dnsmonitor"
cask "filemonitor"
cask "processmonitor"

# Applications
cask "1password"
cask "iina"
cask "notion"
cask "nvidia-geforce-now"
cask "private-internet-access"
cask "steam"
cask "transmission"

# Communication
cask "discord"
cask "signal"
cask "twobird"
cask "zoom"

# Cloud CLIs
cask "google-cloud-sdk"

## macOS applications
mas "Xcode", id: 497799835

mas "Affinity Photo 2", id: 1616822987
mas "DaisyDisk", id: 411643860
mas "DaVinci Resolve", id: 571213070
mas "Fantastical", id: 975937182
mas "Flighty", id: 1358823008
mas "Messenger", id: 1480068668
mas "Microsoft Remote Desktop", id: 1295203466
mas "Parcel", id: 639968404
mas "PDF Expert", id: 1055273043
mas "Pixelmator Pro", id: 1289583905
mas "Slack for Desktop", id: 803453959
mas "Tailscale", id: 1475387142
mas "Telegram Lite", id: 946399090
mas "The Unarchiver", id: 425424353
mas "Things 3", id: 904280696
mas "Wipr", id: 1320666476
