tap "bufbuild/buf"
tap "cargo-lambda/cargo-lambda"
tap "hashicorp/tap"

cask_args appdir: "/Applications"

## Brews
# macOS App Store
brew "mas"

# Shell essentials
brew "zsh"
brew "antidote"
brew "tmux"

# Replacements for system programs
brew "bash"
brew "coreutils"
brew "gawk"
brew "gnu-sed"
brew "grep"
brew "vim"

# Version control
brew "git"

# Git helpers
brew "gh"
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"

# Editors
brew "neovim"

# Languages and package managers
brew "pkl"
brew "protobuf"
brew "python"
brew "hashicorp/tap/terraform"

brew "mise"   # Language-agnostic
brew "opam"   # Manages OCaml
brew "rustup" # Manages Rust

brew "uv"   # Python package installer
brew "ruff" # Python linter/formatter

brew "bazelisk"         # Bazel version manager
brew "bufbuild/buf/buf" # Protobuf project manager
brew "cargo-lambda"     # AWS Lambda functions in Rust
brew "dnscontrol"       # DNS configuration as code
brew "golangci-lint"    # Golang linter
brew "rust-analyzer"    # Rust LSP
brew "shellcheck"       # Bash static analysis
brew "tflint"           # Terraform linter

# Databases
brew "postgresql@17"
brew "sqlite"

# Shell niceties
brew "curlie"
brew "fzf"
brew "gnupg"
brew "htop"
brew "jq"
brew "ncdu"
brew "wget"

# Rust-based shell tools
brew "bat"       # cat
brew "difftastic"
brew "eza"       # ls
brew "hyperfine" # bench
brew "fd"        # find
brew "ripgrep"   # grep
brew "xsv"

# Containers
brew "dive"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "skopeo"

# Kubernetes
brew "helm"
brew "k3d"

# External services
brew "magic-wormhole"

# Video
brew "ffmpeg"
brew "yt-dlp"

# Image manipulation
brew "pngcrush"
brew "pngquant"

# Documentation
brew "graphviz"
brew "pandoc"

# Cloud CLIs
brew "awscli"

# Fonts
brew "fontforge"

## Casks
# Programming tools
cask "emacs"
cask "ghostty"
cask "iterm2"
cask "orbstack"
cask "utm"

# Utilities
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "karabiner-elements"
cask "monitorcontrol"
cask "rectangle"

# AI
cask "ollama"

# Browsers
cask "arc"
cask "firefox"
cask "google-chrome"

# Storage
cask "dropbox"

# Audio
cask "audio-hijack"
cask "focusrite-control"
cask "spotify"

# Applications
cask "1password"
cask "iina"
cask "notion"
cask "steam"
cask "transmission"

# Communication
cask "discord"
cask "obs"
cask "signal"
cask "zoom"

# Cloud CLIs
cask "google-cloud-sdk"

## macOS applications
mas "Xcode", id: 497799835

mas "Affinity Photo 2", id: 1616822987
mas "DaisyDisk", id: 411643860
mas "DaVinci Resolve", id: 571213070
mas "Fantastical", id: 975937182
mas "Flighty", id: 1358823008
mas "Messenger", id: 1480068668
mas "Parcel", id: 639968404
mas "PDF Expert", id: 1055273043
mas "Pixelmator Pro", id: 1289583905
mas "Slack for Desktop", id: 803453959
mas "Tailscale", id: 1475387142
mas "Telegram Lite", id: 946399090
mas "The Unarchiver", id: 425424353
mas "Things 3", id: 904280696
mas "Windows App", id: 1295203466
mas "Wipr", id: 1320666476
