tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

tap "hashicorp/tap"
tap "railwaycat/emacsmacport"
tap "rs/tap"
tap "yt-dlp/taps"

cask_args appdir: "/Applications"

## Brews
# macOS App Store
brew "mas"

# Shell essentials
brew "zsh"
brew "antidote"
brew "tmux"

# Replacements for system programs
brew "bash"
brew "coreutils"
brew "gawk"
brew "gnu-sed"
brew "grep"
brew "vim"

# Version control
brew "git"
brew "mercurial"
brew "subversion" # Needed for font-source-code-pro

# Git helpers
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"

# Editors
brew "neovim"

# Languages and package managers
brew "python"
brew "hashicorp/tap/terraform"

brew "asdf"        # Language-agnostic
brew "opam"        # Manages OCaml
brew "rustup-init" # Manages Rust

# Rust
brew "rust-analyzer"

# Databases
brew "postgresql@15"

# Shell niceties
brew "curlie"
brew "fzf"
brew "htop"
brew "jq"
brew "ncdu"
brew "shellcheck"
brew "tldr"
brew "tree"
brew "wget"

# Rust-based shell tools
brew "bat"       # cat
brew "difftastic"
brew "exa"       # ls
brew "hyperfine" # bench
brew "fd"        # find
brew "ripgrep"   # grep
brew "xsv"

# Containers
brew "dive"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "k3d"
brew "skopeo"

# External services
brew "magic-wormhole"
brew "mitmproxy"

# Video
brew "ffmpeg"
brew "yt-dlp"

# Miscellaneous tools
brew "gnupg"
brew "graphviz"
brew "pandoc"
brew "pngcrush"
brew "pngquant"

## Casks
# Fonts
cask "font-dejavu"
cask "font-fira-sans"
cask "font-source-code-pro"

# Programming tools
cask "emacs-mac"
cask "iterm2"
cask "orbstack"
cask "utm"

# Utilities
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "karabiner-elements"
cask "linearmouse"
cask "monitorcontrol"
cask "rectangle"

# Browsers
cask "firefox-beta"
cask "google-chrome"

# Storage
cask "dropbox"

# Audio
cask "audio-hijack"
cask "focusrite-control"
cask "spotify"

# Applications
cask "1password"
cask "iina"
cask "notion"
cask "private-internet-access"
cask "steam"
cask "transmission"

# Communication
cask "discord"
cask "twobird"
cask "zoom"

# External services
cask "google-cloud-sdk"

## macOS applications
mas "Xcode", id: 497799835

mas "Affinity Photo 2", id: 1616822987
mas "DaisyDisk", id: 411643860
mas "DaVinci Resolve", id: 571213070
mas "Diffusers", id: 1666309574
mas "Fantastical", id: 975937182
mas "Messenger", id: 1480068668
mas "Parcel", id: 639968404
mas "PDF Expert", id: 1055273043
mas "Pixelmator Pro", id: 1289583905
mas "Slack for Desktop", id: 803453959
mas "Tailscale", id: 1475387142
mas "Telegram Lite", id: 946399090
mas "The Unarchiver", id: 425424353
mas "Things 3", id: 904280696
mas "Wipr", id: 1320666476
